# Combining DataFrames

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [1]:
import numpy as np
import pandas as pd

In [2]:
d_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [3]:
d_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [4]:
one = pd.DataFrame(d_one)

In [5]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [6]:
two = pd.DataFrame(d_two)

In [7]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

## Axis = 0

## Concatenate along rows

In [8]:
axis0 = pd.concat([one,two],axis=0)

In [9]:
axis0

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

## Axis = 1

## Concatenate along columns

In [10]:
axis1 = pd.concat([one,two] , axis=1)

In [11]:
axis1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

## Axis 0 but columns match up

In [12]:
two.columns = one.columns

In [13]:
pd.concat([one,two])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

## Merge

In [14]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['jack','steve','Claire','john']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','jack','sam','steve']})

In [15]:
registrations

   reg_id    name
0       1    jack
1       2   steve
2       3  Claire
3       4    john

In [16]:
logins

   log_id    name
0       1  Xavier
1       2    jack
2       3     sam
3       4   steve

## pd.merge()

Merge pandas DataFrames based on key columns, similar to a SQL join.

In [17]:
# help(pd.merge)

## Inner,Left, Right, and Outer Joins

## Inner Join

*  It returns a dataframe with only those rows that have common characteristics.
* An inner join requires each row in the two joined dataframes to have matching column values.

In [18]:
#  pd.merge doesn't take in a list like concat
pd.merge(registrations,logins,how='inner',on='name')

   reg_id   name  log_id
0       1   jack       2
1       2  steve       4

In [19]:
# Pandas smart enough to figure out key column (on parameter) if only one column name matches up
pd.merge(registrations,logins,how='inner')

   reg_id   name  log_id
0       1   jack       2
1       2  steve       4

In [20]:
# Pandas reports an error if "on" key column isn't in both dataframes
# pd.merge(registrations,logins,how='inner',on='reg_id')

## Left Join

* A left join, or left merge, keeps every row from the left dataframe. 
*  Rows in the left dataframe that have no corresponding join value in the right dataframe are left with NaN values.

In [21]:
pd.merge(registrations,logins,how='left')

   reg_id    name  log_id
0       1    jack     2.0
1       2   steve     4.0
2       3  Claire     NaN
3       4    john     NaN

## Right Join

* A Right join, or Right merge, keeps every row from the Right dataframe.
* Rows in the right dataframe that have no corresponding join value in the left dataframe are left with NaN values.

In [22]:
pd.merge(registrations,logins,how='right')

   reg_id    name  log_id
0     NaN  Xavier       1
1     1.0    jack       2
2     NaN     sam       3
3     2.0   steve       4

## Outer Join

* Outer join Match up on all info found in either Left or Right Table.
* Show everyone fill any missing info with NaN.

In [23]:
pd.merge(registrations,logins,how='outer')

   reg_id    name  log_id
0     1.0    jack     2.0
1     2.0   steve     4.0
2     3.0  Claire     NaN
3     4.0    john     NaN
4     NaN  Xavier     1.0
5     NaN     sam     3.0

## Join on Index or Column

Use combinations of left_on,right_on,left_index,right_index to merge a column or index on each other

In [24]:
registrations

   reg_id    name
0       1    jack
1       2   steve
2       3  Claire
3       4    john

In [25]:
logins

   log_id    name
0       1  Xavier
1       2    jack
2       3     sam
3       4   steve

In [26]:
registrations = registrations.set_index("name")

In [27]:
registrations

        reg_id
name
jack         1
steve        2
Claire       3
john         4

In [28]:
pd.merge(registrations,logins,left_index=True,right_on='name',how ='inner')

   reg_id  log_id   name
1       1       2   jack
3       2       4  steve

In [29]:
pd.merge(logins,registrations,right_index=True,left_on='name')

   log_id   name  reg_id
1       2   jack       1
3       4  steve       2

## Dealing with differing key column names in joined tables

In [30]:
registrations = registrations.reset_index()

In [31]:
registrations

     name  reg_id
0    jack       1
1   steve       2
2  Claire       3
3    john       4

In [32]:
logins

   log_id    name
0       1  Xavier
1       2    jack
2       3     sam
3       4   steve

In [33]:
registrations.columns = ['reg_name','reg_id']

In [34]:
registrations

  reg_name  reg_id
0     jack       1
1    steve       2
2   Claire       3
3     john       4

In [35]:
pd.merge(registrations,logins,left_on='reg_name',right_on='name')

  reg_name  reg_id  log_id   name
0     jack       1       2   jack
1    steve       2       4  steve

In [36]:
pd.merge(registrations,logins,left_on='reg_name',right_on='name').drop('reg_name',axis=1)

   reg_id  log_id   name
0       1       2   jack
1       2       4  steve

## Pandas automatically tags duplicate columns

In [37]:
registrations.columns = ['name','id']

In [38]:
logins.columns = ['id','name']

In [39]:
registrations

     name  id
0    jack   1
1   steve   2
2  Claire   3
3    john   4

In [40]:
logins

   id    name
0   1  Xavier
1   2    jack
2   3     sam
3   4   steve

In [41]:
pd.merge(registrations,logins,on='name')

    name  id_x  id_y
0   jack     1     2
1  steve     2     4

In [42]:
pd.merge(registrations,logins,on='name',suffixes=('_reg','_log'))

    name  id_reg  id_log
0   jack       1       2
1  steve       2       4

## Practice Practice and Practice